app/controllers/books_controller.rb

  def ensure_correct_user
    @user = User.find_by(id:params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

 def show
    @user= current_user
    @book= Book.new
    @books= Book.find(params[:id])
    @users = User.find_by(id:params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 61], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 61], ["LIMIT", 1]]

 def create
     @book =Book.new(book_params)
     @book.user_id = current_user.id
     if  @book.save
       flash[:notice] = "successfull"
      redirect_to book_path(@book)
    else
     @books =Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "sdfg"], ["body", "fg"], ["created_at", "2019-02-27 12:39:02.703719"], ["updated_at", "2019-02-27 12:39:02.703719"], ["user_id", "8"]]
SELECT "books".* FROM "books"

  def update
   book=Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]