app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
 def show
   @user= User.new
    @book= Book.new
    @books= Book.find(params[:id])

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", ""], ["created_at", "2019-02-24 11:31:22.375909"], ["updated_at", "2019-02-24 11:31:22.375909"]]
---
 def create
     @book =Book.new(book_params)
     @book.user = current_user
     if  @book.save

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 68]]
---
   def destroy
     book = Book.find(params[:id])
      book.destroy