app/controllers/users_controller.rb

  def show
    @book= Book.new
    @books= Book.all
    @user= User.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def index
    @user =current_user
    @book =Book.new
    @user_image = UserImage.new
    @users = User.all
---
SELECT "users".* FROM "users"